# ForgeTypeId Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ForgeTypeId Constructor
ForgeTypeId Class See Also
---
Constructs a ForgeTypeId holding an empty schema identifier.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public ForgeTypeId()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
ForgeTypeId()
```

# See Also
ForgeTypeId Class
ForgeTypeId Overload
Autodesk.Revit.DB Namespace